// Создать программу сложения двух целых чисел с выведением суммы
int numberA = 31;
int numberB = 54;
int result = numberA + numberB;
Console.Write("Sum = ");
Console.WriteLine(result);